Revit 2024 API
Outline Constructor (Outline)
 Constructs a new copy of the input Outline object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public Outline(
	Outline other
)
Visual Basic
Public Sub New ( _
	other As Outline _
)
Visual C++
public:
Outline(
	Outline^ other
)
Parameters
other
Type: Autodesk.Revit.DB.Outline
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Outline Class
Outline Overload
Autodesk.Revit.DB Namespace